
{
    "BrandCentral": {
        "Cars": {
            "Manufacturers": {
                "Alpine": [
                    {
                        "Model": "AAX 115i",
                        "Displacement": "1998cc",
                        "Year": 2013,
                        "img": "path/to/img.jpg"
                    },
                    {
                        "Model": "DSM iType",
                        "Displacement": "1249cc",
                        "Year": 1999
                    }
                ],
                "BMW": [
                    {
                        "Model": "120d E87",
                        "Displacement": "2000cc",
                        "Year": 2006
                    }
                ],
                "Mazda": [
                    {
                        "Model": "RX-8 Spirit R '12",
                        "Year": 2012,
                        "Cost": 32500,
                        "Type": "Road Car",
                        "Country": "Japan",
                        "Colours": [
                            "Aluminum Metallic",
                            "Sparkling Black Mica",
                            "Crystal White Pearl Mica"
                        ],
                        "Measurements": {
                            "Length": 4470,
                            "Width": 1770,
                            "Height": 1340,
                            "Weight": 1350
                        },
                        "Base_performance": {
                            "Displacment": "654x2cc",
                            "Drivetrain": "FR",
                            "Aspiration": "NA",
                            "MaxPower": "230bhp / 8,000rpm",
                            "PP": 487.45,
                            "MaxTorque": "22,0kgfm / 5,500rpm"
                        },
                        "Tuning": {

                        },
                        "Short_desc": "The final version of the RX-8, Mazda's rotary engine sports car with a unique 4-door layout.",
                        "Full_desc": "Introduced in 2011, the Mazda RX-8 Spirit R was the final special edition model of the RX-8 that was first released in 2003. The RX-8 had two distinct personalities, depending on the gearbox you chose. Cars equipped with the 6-speed manual drove like a pure sport car, with brisk acceleration and more driver control, while those with the 6-speed automatic essentially behaved like luxury grand tourers. The Spirit R equipped with the 6-speed manual was based on the sporty Type RS, and featured extra aero parts and a sporty suspension setup, complete with Bilstein dampers. The automatic Spirit R was based on the Type E and included luxury accoutrements, such as leather seats. The car's Renesis rotary engine produced 235HP and 159 ft.-lb. of torque. The lifespan of the Spirit R was short-lived, as Mazda discontinued the RX-8 in June 2012. Because of that, initial orders for the Spirit R exceeded the intended batch of 1000 units, so Mazda produced another 1000 to meet demand."
                    }
                ]
            }
        }
    },
    "UsedCarDealership": {

    },
    "LegendaryDealer": {

    },
    "Races": {

    }
}

// detailed tuning stats, possible tuning parts you can buy, body kits, spoilers, widebody yes/no,
// maxperformance achieved
// race info: credits, pp limit, rewards
